2021.08.10.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.08.03.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.08.17.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of August 03 to 10, 2021.

#+TOC: headlines 1


* Lwt 5.4.2
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-lwt-5-4-2/8248/1

** Raphaël Proust announced


We are glad to announce the release of version 5.4.2 of Lwt: a bugfix-only release.

https://github.com/ocsigen/lwt/releases/tag/5.4.2

You can update to this version in ~opam~ :

#+begin_example
opam update
opam upgrade lwt
#+end_example

Thanks to the contributors for finding and fixing the bugs, leading to this release. Check
out the release notes (link above) for a full list.
      



* OCaml Workshop 2021: Call for Volunteers
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ocaml-workshop-2021-call-for-volunteers/8253/1

** Frédéric Bour announced


The OCaml Workshop will be held virtually, just like last year. We are looking for volunteers
to fill the role of session host.

*** [[https://icfp20.sigplan.org/home/ocaml-2020#session-hosts][Session Hosts]]

On August 27, the session hosts will assist session chairs in streaming the pre-recorded
videos as well as helping and moderating the Q&A sessions. They will also be responsible for
security and be ready to react to potential threats and wrongdoers.

This year there will be only one broadcast for each session, but the workshop day will be
quite long. There will be six sessions, lasting one hour and a half, as well as a one hour
keynote.

**** [[https://icfp20.sigplan.org/home/ocaml-2020#duties][Duties]]

- Moderating the text chats
- Controlling microphones in the video-conferencing
- Watching for the time
- Performing sound checks
- Welcoming and otherwise guiding participants
      



* opam 2.1.0!
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-opam-2-1-0/8255/1

** R. Boujbel announced


We are happy to announce two opam releases: the freshly new
[[https://github.com/ocaml/opam/releases/tag/2.1.0][2.1.0]] & the LTS support
[[https://github.com/ocaml/opam/releases/tag/2.0.9][2.0.9]].

*** What's new in opam 2.1.0?
- Integration of system dependencies (formerly the `opam-depext` plugin), increasing their reliability as it integrates the solving step
- Creation of lock files for reproducible installations (formerly the `opam-lock` plugin)
- Switch invariants, replacing the _"base packages"_ in opam 2.0 and allowing for easier compiler upgrades
- Improved options configuration (see the new `option` and expanded `var` sub-commands)
- CLI versioning, allowing cleaner deprecations for opam now and also improvements to semantics in future without breaking backwards-compatibility
- opam root readability by newer and older versions, even if the format changed
- Performance improvements to opam-update, conflict messages, and many other areas

You'll find these features presentation in the [[https://opam.ocaml.org/blog/opam-2-1-0][blog
post]] ; and for a full complete you can take a look
[[https://github.com/ocaml/opam/releases][pre-releases changelogs]].

*** What's in 2.0.9

This 2.0.9 version contains back-ported fixes, you can find more information in this [[https://opam.ocaml.org/blog/opam-2-0-9][blog
post]], especially for fish users & sandbox updates.

*Tremendous thanks to all involved people, all those who've tested, re-tested, tested again, given feedback, commented on issues, tested, tested, tested again...!*

/The opam team/ 🐪
      



* containers 3.5
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-containers-3-5/8257/1

** Simon Cruanes announced


I'm glad to announce that version 3.5 of
[[https://github.com/c-cube/ocaml-containers][containers]] has just been released. There's a
bugfix for bitvectors, and a tasteful assortment of new functions (see changelog). I want to
thank all the contributors, among whom first time contributor @favonia.

The release and changelog can be found
[[https://github.com/c-cube/ocaml-containers/releases/tag/v3.5][here]]
      



* Short contract job for OCaml/C++ programmer
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/short-contract-job-for-ocaml-c-programmer/8260/1

** Ashish Agarwal announced


We have a small project (possibly only days of work) for an experienced OCaml and C++
programmer. If you are available for a short engagement as a contractor, please DM me. Thank
you.
      



* http-multipart-formdata v3.0.1 released
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-http-multipart-formdata-v3-0-1-released/8261/1

** Bikal Lem announced


I am pleased to announce v3.0.1 of ~http-multipart-formdata~. This release follows a major
overhaul of the parser as well as the design of the library. Here is the summary of changes:

1. Flatten module ~Part_header~ to ~part_header~
2. Implement reader/pull based parser to retrieve multipart parts, i.e. implement a ~streaming~ design. This is very useful if the HTTP file upload is large.
3. Implement push-based incremental input model, i.e. the library is now a non-blocking multipart parser
4. Remove dependency on IO based libs such as ~lwt, async~ since it is no longer needed due to point 3 above.

Github repo: [[https://github.com/lemaetech/http-multipart-formdata][http-multipart-formdata]]

API doc : [[https://lemaetech.co.uk/http-multipart-formdata/http-multipart-formdata/Http_multipart_formdata/index.html][API
manual]]
      



* wtr (Well Typed Router) v2.0.0 released
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-wtr-well-typed-router-v2-0-0-released/8262/1

** Bikal Lem announced


I am pleased to announce v2.0.0 release of ~wtr (Well Typed Router)~. ~wtr~ is a trie-based
router for OCaml HTTP web applications.

v2.0.0 release adds support for specifying and matching HTTP methods in a router. So now we
can do the following;
#+begin_src ocaml
Wtr.(
    create
      [ {%wtr| get,post,head,delete  ; /home/about/  |} about_page
      ; {%wtr| head                  ; /home/:int/   |} prod_page
      ]
#+end_src
Note: we can specify single or multiple HTTP methods supported by a route.

The release also features a pretty-printer - ~Wtr.pp~ - for a ~Wtr.t~ type. This has proven
to be very useful when diagnosing/understanding routing issues. Sample output below,
#+begin_example
   POST
     /home
       /about
         /
       /:float
         /
   HEAD
     /home
       /about
         /
       /:int
         /
#+end_example

The manual has also been improved in this release.

- [[https://lemaetech.co.uk/wtr/wtr/Wtr/index.html][wtr API]]
- [[https://github.com/lemaetech/wtr/blob/main/examples/cohttp.ml][CoHTTP demo]]
- [[https://github.com/lemaetech/wtr/blob/main/examples/demo.ml][CLI demo]]
- [[https://github.com/lemaetech/wtr/blob/main/CHANGES.md#v200-2021-08-02][Changes v2.0.0]]
      



* New playlist just dropped
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/new-playlist-just-dropped/8272/1

** Rahul announced


Haven't watched them all yet, but these look like they'd be a great resource for anyone
wanting to learn OCaml:
https://www.youtube.com/watch?v=MUcka_SvhLw&list=PLre5AT9JnKShBOPeuiD9b-I4XROIJhkIU
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 9
:END:
** From the ocamlcore planet blog


Here are links from many OCaml blogs aggregated at [[http://ocaml.org/community/planet/][OCaml Planet]].

- [[https://www.ocamlpro.com/2021/08/05/opam-2-1-0-is-released/][opam 2.1.0 is released!]]
- [[https://www.ocamlpro.com/2021/08/05/opam-2-0-9-release/][opam 2.0.9 release]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
