2021.08.10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-10 Tue 18:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.08.03.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.08.17.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of August 03 to 10, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Lwt 5.4.2</a></li>
<li><a href="#2">OCaml Workshop 2021: Call for Volunteers</a></li>
<li><a href="#3">opam 2.1.0!</a></li>
<li><a href="#4">containers 3.5</a></li>
<li><a href="#5">Short contract job for OCaml/C++ programmer</a></li>
<li><a href="#6">http-multipart-formdata v3.0.1 released</a></li>
<li><a href="#7">wtr (Well Typed Router) v2.0.0 released</a></li>
<li><a href="#8">New playlist just dropped</a></li>
<li><a href="#9">Other OCaml News</a></li>
<li><a href="#org1e94e89">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Lwt 5.4.2</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-lwt-5-4-2/8248/1">https://discuss.ocaml.org/t/ann-lwt-5-4-2/8248/1</a>
</p>
</div>

<div id="outline-container-org58309fa" class="outline-3">
<h3 id="org58309fa">Raphaël Proust announced</h3>
<div class="outline-text-3" id="text-org58309fa">
<p>
We are glad to announce the release of version 5.4.2 of Lwt: a bugfix-only release.
</p>

<p>
<a href="https://github.com/ocsigen/lwt/releases/tag/5.4.2">https://github.com/ocsigen/lwt/releases/tag/5.4.2</a>
</p>

<p>
You can update to this version in <code>opam</code> :
</p>

<pre class="example" id="orgc41e523">
opam update
opam upgrade lwt
</pre>

<p>
Thanks to the contributors for finding and fixing the bugs, leading to this release. Check
out the release notes (link above) for a full list.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">OCaml Workshop 2021: Call for Volunteers</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-workshop-2021-call-for-volunteers/8253/1">https://discuss.ocaml.org/t/ocaml-workshop-2021-call-for-volunteers/8253/1</a>
</p>
</div>

<div id="outline-container-orge0c2ea2" class="outline-3">
<h3 id="orge0c2ea2">Frédéric Bour announced</h3>
<div class="outline-text-3" id="text-orge0c2ea2">
<p>
The OCaml Workshop will be held virtually, just like last year. We are looking for volunteers
to fill the role of session host.
</p>
</div>

<div id="outline-container-org4ed88b5" class="outline-4">
<h4 id="org4ed88b5"><a href="https://icfp20.sigplan.org/home/ocaml-2020#session-hosts">Session Hosts</a></h4>
<div class="outline-text-4" id="text-org4ed88b5">
<p>
On August 27, the session hosts will assist session chairs in streaming the pre-recorded
videos as well as helping and moderating the Q&amp;A sessions. They will also be responsible for
security and be ready to react to potential threats and wrongdoers.
</p>

<p>
This year there will be only one broadcast for each session, but the workshop day will be
quite long. There will be six sessions, lasting one hour and a half, as well as a one hour
keynote.
</p>
</div>

<div id="outline-container-org95ffe14" class="outline-5">
<h5 id="org95ffe14"><a href="https://icfp20.sigplan.org/home/ocaml-2020#duties">Duties</a></h5>
<div class="outline-text-5" id="text-org95ffe14">
<ul class="org-ul">
<li>Moderating the text chats</li>
<li>Controlling microphones in the video-conferencing</li>
<li>Watching for the time</li>
<li>Performing sound checks</li>
<li>Welcoming and otherwise guiding participants</li>
</ul>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">opam 2.1.0!</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-1-0/8255/1">https://discuss.ocaml.org/t/ann-opam-2-1-0/8255/1</a>
</p>
</div>

<div id="outline-container-org07dab0e" class="outline-3">
<h3 id="org07dab0e">R. Boujbel announced</h3>
<div class="outline-text-3" id="text-org07dab0e">
<p>
We are happy to announce two opam releases: the freshly new
<a href="https://github.com/ocaml/opam/releases/tag/2.1.0">2.1.0</a> &amp; the LTS support
<a href="https://github.com/ocaml/opam/releases/tag/2.0.9">2.0.9</a>.
</p>
</div>

<div id="outline-container-org99bfcc8" class="outline-4">
<h4 id="org99bfcc8">What's new in opam 2.1.0?</h4>
<div class="outline-text-4" id="text-org99bfcc8">
<ul class="org-ul">
<li>Integration of system dependencies (formerly the `opam-depext` plugin), increasing their reliability as it integrates the solving step</li>
<li>Creation of lock files for reproducible installations (formerly the `opam-lock` plugin)</li>
<li>Switch invariants, replacing the <span class="underline">"base packages"</span> in opam 2.0 and allowing for easier compiler upgrades</li>
<li>Improved options configuration (see the new `option` and expanded `var` sub-commands)</li>
<li>CLI versioning, allowing cleaner deprecations for opam now and also improvements to semantics in future without breaking backwards-compatibility</li>
<li>opam root readability by newer and older versions, even if the format changed</li>
<li>Performance improvements to opam-update, conflict messages, and many other areas</li>
</ul>

<p>
You'll find these features presentation in the <a href="https://opam.ocaml.org/blog/opam-2-1-0">blog
post</a> ; and for a full complete you can take a look
<a href="https://github.com/ocaml/opam/releases">pre-releases changelogs</a>.
</p>
</div>
</div>

<div id="outline-container-org1df1ed5" class="outline-4">
<h4 id="org1df1ed5">What's in 2.0.9</h4>
<div class="outline-text-4" id="text-org1df1ed5">
<p>
This 2.0.9 version contains back-ported fixes, you can find more information in this <a href="https://opam.ocaml.org/blog/opam-2-0-9">blog
post</a>, especially for fish users &amp; sandbox updates.
</p>

<p>
<b>Tremendous thanks to all involved people, all those who've tested, re-tested, tested again, given feedback, commented on issues, tested, tested, tested again&#x2026;!</b>
</p>

<p>
<i>The opam team</i> 🐪
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">containers 3.5</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-containers-3-5/8257/1">https://discuss.ocaml.org/t/ann-containers-3-5/8257/1</a>
</p>
</div>

<div id="outline-container-org1419209" class="outline-3">
<h3 id="org1419209">Simon Cruanes announced</h3>
<div class="outline-text-3" id="text-org1419209">
<p>
I'm glad to announce that version 3.5 of
<a href="https://github.com/c-cube/ocaml-containers">containers</a> has just been released. There's a
bugfix for bitvectors, and a tasteful assortment of new functions (see changelog). I want to
thank all the contributors, among whom first time contributor @favonia.
</p>

<p>
The release and changelog can be found
<a href="https://github.com/c-cube/ocaml-containers/releases/tag/v3.5">here</a>
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Short contract job for OCaml/C++ programmer</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/short-contract-job-for-ocaml-c-programmer/8260/1">https://discuss.ocaml.org/t/short-contract-job-for-ocaml-c-programmer/8260/1</a>
</p>
</div>

<div id="outline-container-orgfbd271c" class="outline-3">
<h3 id="orgfbd271c">Ashish Agarwal announced</h3>
<div class="outline-text-3" id="text-orgfbd271c">
<p>
We have a small project (possibly only days of work) for an experienced OCaml and C++
programmer. If you are available for a short engagement as a contractor, please DM me. Thank
you.
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">http-multipart-formdata v3.0.1 released</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-http-multipart-formdata-v3-0-1-released/8261/1">https://discuss.ocaml.org/t/ann-http-multipart-formdata-v3-0-1-released/8261/1</a>
</p>
</div>

<div id="outline-container-orgd81c422" class="outline-3">
<h3 id="orgd81c422">Bikal Lem announced</h3>
<div class="outline-text-3" id="text-orgd81c422">
<p>
I am pleased to announce v3.0.1 of <code>http-multipart-formdata</code>. This release follows a major
overhaul of the parser as well as the design of the library. Here is the summary of changes:
</p>

<ol class="org-ol">
<li>Flatten module <code>Part_header</code> to <code>part_header</code></li>
<li>Implement reader/pull based parser to retrieve multipart parts, i.e. implement a <code>streaming</code> design. This is very useful if the HTTP file upload is large.</li>
<li>Implement push-based incremental input model, i.e. the library is now a non-blocking multipart parser</li>
<li>Remove dependency on IO based libs such as <code>lwt, async</code> since it is no longer needed due to point 3 above.</li>
</ol>

<p>
Github repo: <a href="https://github.com/lemaetech/http-multipart-formdata">http-multipart-formdata</a>
</p>

<p>
API doc : <a href="https://lemaetech.co.uk/http-multipart-formdata/http-multipart-formdata/Http_multipart_formdata/index.html">API
manual</a>
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">wtr (Well Typed Router) v2.0.0 released</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-wtr-well-typed-router-v2-0-0-released/8262/1">https://discuss.ocaml.org/t/ann-wtr-well-typed-router-v2-0-0-released/8262/1</a>
</p>
</div>

<div id="outline-container-org02eb18d" class="outline-3">
<h3 id="org02eb18d">Bikal Lem announced</h3>
<div class="outline-text-3" id="text-org02eb18d">
<p>
I am pleased to announce v2.0.0 release of <code>wtr (Well Typed Router)</code>. <code>wtr</code> is a trie-based
router for OCaml HTTP web applications.
</p>

<p>
v2.0.0 release adds support for specifying and matching HTTP methods in a router. So now we
can do the following;
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #228b22;">Wtr.</span>(
    create
      [ {<span style="color: #a52a2a;">%</span>wtr| get,post,head,delete  ; /home/about/  |} about_page
      ; {<span style="color: #a52a2a;">%</span>wtr| head                  ; /home/:int/   |} prod_page
      ]
</pre>
</div>
<p>
Note: we can specify single or multiple HTTP methods supported by a route.
</p>

<p>
The release also features a pretty-printer - <code>Wtr.pp</code> - for a <code>Wtr.t</code> type. This has proven
to be very useful when diagnosing/understanding routing issues. Sample output below,
</p>
<pre class="example" id="org292946e">
POST
  /home
    /about
      /
    /:float
      /
HEAD
  /home
    /about
      /
    /:int
      /
</pre>

<p>
The manual has also been improved in this release.
</p>

<ul class="org-ul">
<li><a href="https://lemaetech.co.uk/wtr/wtr/Wtr/index.html">wtr API</a></li>
<li><a href="https://github.com/lemaetech/wtr/blob/main/examples/cohttp.ml">CoHTTP demo</a></li>
<li><a href="https://github.com/lemaetech/wtr/blob/main/examples/demo.ml">CLI demo</a></li>
<li><a href="https://github.com/lemaetech/wtr/blob/main/CHANGES.md#v200-2021-08-02">Changes v2.0.0</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">New playlist just dropped</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/new-playlist-just-dropped/8272/1">https://discuss.ocaml.org/t/new-playlist-just-dropped/8272/1</a>
</p>
</div>

<div id="outline-container-org9aefd87" class="outline-3">
<h3 id="org9aefd87">Rahul announced</h3>
<div class="outline-text-3" id="text-org9aefd87">
<p>
Haven't watched them all yet, but these look like they'd be a great resource for anyone
wanting to learn OCaml:
<a href="https://www.youtube.com/watch?v=MUcka_SvhLw&amp;list=PLre5AT9JnKShBOPeuiD9b-I4XROIJhkIU">https://www.youtube.com/watch?v=MUcka_SvhLw&amp;list=PLre5AT9JnKShBOPeuiD9b-I4XROIJhkIU</a>
</p>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">Other OCaml News</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgb85fa0a" class="outline-3">
<h3 id="orgb85fa0a">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgb85fa0a">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://www.ocamlpro.com/2021/08/05/opam-2-1-0-is-released/">opam 2.1.0 is released!</a></li>
<li><a href="https://www.ocamlpro.com/2021/08/05/opam-2-0-9-release/">opam 2.0.9 release</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org1e94e89" class="outline-2">
<h2 id="org1e94e89">Old CWN</h2>
<div class="outline-text-2" id="text-org1e94e89">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="orgfab6d39">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
